app/controllers/collections_controller.rb

INSERT INTO "collections" ("vegetarian_favorites", "meat_lovers", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["vegetarian_favorites", "Kushi Tsuru"], ["meat_lovers", "The Stinking Rose"], ["user_id", 4], ["created_at", "2021-11-09 17:43:47.865362"], ["updated_at", "2021-11-09 17:43:47.865362"]]
---
  def create
    @collection = current_user.collections.build(collection_params)

    if @collection.save

SELECT "collections".* FROM "collections" WHERE "collections"."user_id" = $1 AND "collections"."id" = $2 LIMIT $3  [["user_id", 6], ["id", nil], ["LIMIT", 1]]
---
  def find_collection
    @collection = current_user.collections.find_by(id: params[:id])