app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def find_restaurant
    @restaurant = Restaurant.find(params[:id])