app/models/restaurant.rb

INSERT INTO "restaurants" ("name", "opening_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Kushi Tsuru"], ["opening_date", "2021-11-08 11:30:00"], ["created_at", "2021-11-08 21:47:32.475105"], ["updated_at", "2021-11-08 21:47:32.475105"]]
---
  def self.csv_import
    CSV.foreach('lib/tasks/glints.csv', encoding: 'ISO-8859-1', liberal_parsing: true) do |row|
      Restaurant.create!(name: row[0], opening_date: row[1])